artillery.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: request rate

scenarios:
  - flow:
      - post:
          url: '/login'
          json:
            name: 'admin'
            login: 'admin'
            password: 'admin'
          capture:
            - json: $.token
              as: token
      - get:
          url: '/users'
          headers:
            authorization: 'Bearer {{token}}'
      - post:
          url: '/users'
          json:
            name: 'user1'
            login: 'user1'
            password: 'user1'
          headers:
            authorization: 'Bearer {{token}}'
          capture:
            - json: $.id
              as: id
      - get:
          url: '/users/{{id}}'
          headers:
            authorization: 'Bearer {{token}}'
      - put:
          url: '/users/{{id}}'
          json:
            name: 'user2'
            login: 'user2'
            password: 'user2'
          headers:
            authorization: 'Bearer {{token}}'
      - delete:
          url: '/users/{{id}}'
          headers:
            authorization: 'Bearer {{token}}'